tap 'nodenv/nodenv'
tap 'heroku/brew'

brew 'heroku'
brew 'imagemagick'
brew 'nodenv-aliases'
brew 'nodenv-vars'
brew 'nodenv'
brew 'parity'
brew 'pipenv'
brew 'rbenv-aliases'
brew 'rbenv-vars'
brew 'rbenv'
brew 'ruby-build'
brew 'yarn'
brew 'zplug'

brew 'postgresql', start_service: false
brew 'mysql', start_service: false

# Build tools and libs
brew 'coreutils'
brew 'gmp'
brew 'libyaml'
brew 'makedepend'
brew 'pkg-config'
brew 'readline'

cask '1password'
cask 'captain'
cask 'chromedriver'
cask 'clipy'
cask 'daisydisk'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'harvest'
cask 'iterm2'
cask 'sequel-pro'
cask 'slack'
cask 'spotify'
cask 'transmission'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'vlc'
