tap 'heroku/brew'

tap 'nodenv/nodenv'
tap 'thoughtbot/formulae'

brew 'git'
brew 'heroku'
brew 'imagemagick'
brew 'node-build'
brew 'nodenv-aliases'
brew 'nodenv-vars'
brew 'nodenv'
brew 'opencv'
brew 'thoughtbot/formulae/parity'
brew 'pipenv'
brew 'romkatv/powerlevel10k/powerlevel10k'
brew 'pyenv'
brew 'rbenv-aliases'
brew 'rbenv-default-gems'
brew 'rbenv-vars'
brew 'rbenv'
brew 'rcm'
brew 'ruby-build'
brew 'switchaudio-osx'
brew 'testssl'
brew 'thefuck'
brew 'tldr'
brew 'wifi-password'
brew 'yarn'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'zsh'
brew 'zplug'

brew 'postgresql', start_service: false
brew 'mysql', start_service: false
brew 'redis', start_service: false

# Build tools and libs
brew 'coreutils'
brew 'gmp'
brew 'libyaml'
brew 'makedepend'
brew 'pkg-config'
brew 'readline'

cask 'alfred'
cask 'android-file-transfer'
cask 'captain'
cask 'chromedriver'
cask 'clipy'
cask 'daisydisk'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'iterm2'
cask 'kap'
cask 'kindle'
cask 'notion'
cask 'numi'
cask 'macdown'
cask 'pgadmin4'
cask 'postman'
cask 'rectangle'
cask 'sequel-pro'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
